# Python aplicado a Big Data
## Dia 3 - 08/03/2021
### Instrutor: Leonardo Galler

### Introdução ao Pandas

### Explorando dados com Dataframes

In [17]:
# imports

import numpy as np
import pandas as pd

#### Bonus - Criando dataframes a partir de um dicionário de arrays NumPy

In [20]:
# Utilizando dicionários de arrays numpy

data = {'order':np.arange(start=0 , stop = 120 , step = 1),
        'temp':np.linspace(start=-10, stop=150, num=120)}

# Criando dataframe com Ndarrays
df = pd.DataFrame(data)

# Descreva o dataframe
print("Descrevendo o dataframe")
print(df.describe())
print()

print("Utilizando describe(include='all')")
print(df.describe(include='all')) # Informa as colunas do dataset e dados a respeito delas
print()

# Apresente o dataframe
print("Apresentando o dataframe")
print(df)
print()

# Informações básicas sobre o dataframe
print("Informações Básicas")
df.info()

Descrevendo o dataframe
            order        temp
count  120.000000  120.000000
mean    59.500000   70.000000
std     34.785054   46.769821
min      0.000000  -10.000000
25%     29.750000   30.000000
50%     59.500000   70.000000
75%     89.250000  110.000000
max    119.000000  150.000000

Utilizando describe(include='all')
            order        temp
count  120.000000  120.000000
mean    59.500000   70.000000
std     34.785054   46.769821
min      0.000000  -10.000000
25%     29.750000   30.000000
50%     59.500000   70.000000
75%     89.250000  110.000000
max    119.000000  150.000000

Apresentando o dataframe
     order        temp
0        0  -10.000000
1        1   -8.655462
2        2   -7.310924
3        3   -5.966387
4        4   -4.621849
..     ...         ...
115    115  144.621849
116    116  145.966387
117    117  147.310924
118    118  148.655462
119    119  150.000000

[120 rows x 2 columns]

Informações Básicas
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   order   120 non-null    int32
 1   temp    120 non-null    float64
dtypes: float64(1), int32(1)
memory usage: 1.5 KB

### Função shape() -> Informa linhas e colunas de um dataframe

In [21]:
print('Quantidade de linhas e colunas =',df.shape) 
print('Quantidade de linhas =', df.shape[0]) 
print('Quantidade de colunas =',df.shape[1])

Quantidade de linhas e colunas = (120, 2)
Quantidade de linhas = 120
Quantidade de colunas = 2

#### Bonus 2 - Criando dataframes a partir de uma lista

In [ ]:
# Criando dataframe utilizando listas
df2 = pd.DataFrame(['Elvis','Michael','BB King','Celine','Alicia'], 
                   columns=['artist'])
                   
print(df2)

#### Bonus 3 - Criando dataframes a partir de dicionários de listas

In [ ]:
data = {'cidade' :['Capao Redondo','Mirandopolis','Paraisopolis','Morumbi'],
        'acesso' :['Dificil','Medio','Dificil','Facil'],
        'visitas':[120,84,112,87]}

df = pd.DataFrame(data)
print(df)

#### Bonus 3.1 - Definindo o índice na inicialização do dataframe

In [3]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])

df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

#### Bonus 4 - Verificando os arquivos do diretório

In [ ]:
import os
# Armazene em uma variável o local onde estarão os arquivos que serão utilizados
data_path = 'C:\\Users\\anton\\OneDrive\\Documentos\\Treinamento Cientista de Dados\\Python Aplicado a Big Data\\Aula 3 - 08032021 - Pandas\\sample-data\\xlsx\\'

files = os.listdir( data_path )
print(type(files)) # é retornada uma lista, pode ser criado um loop para processamento 
                  # sequencial de arquivos.
# Mostre todos os arquivos no diretório
for file in files:
   print(file)

### Criando novas colunas em um dataframe

In [4]:
# Criando dataframe de teste

students = [ ('Jack', 34, 'Sydeny' , 'Australia') ,
             ('Joshua', 30, 'Delhi' , 'India' ) ,
             ('Tom', 31, 'Mumbai' , 'India' ) ,
             ('Alicia', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Osama', 17, 'las vegas' , 'US')  ]

df = pd.DataFrame(students, 
                  columns = ['Name' , 'Age', 'City' , 'Country'], 
                  index=['a', 'b', 'c' , 'd' , 'e' , 'f'])

#### Método 1 - Adicionar uma coluna ao Dataframe do Pandas com um valor padrão.
**Formas de fazer** <br>
1. Declarando uma lista como uma nova coluna <br>
2. Utilizando loc (Você pode usar '.loc' com ':' para adicionar um valor <br> especificado para todas as linhas.). Será visto em Manipulando Dataframes <br>
3. Utilizando .assign() <br>
4. Utilizando .insert() <br>
#####  Paramentros para insert
<li>loc: loc é um inteiro que é a localização de uma coluna onde queremos inserir uma nova coluna. Isso mudará a coluna existente naquela posição para a direita.<br>
<li>column: uma string que é o nome de uma coluna a ser inserida.<br>
<li>value: valor é simplesmente o valor a ser inserido. Pode ser um inteiro, uma string, um float ou mesmo uma série/lista de valores. Fornecer apenas um valor definirá o mesmo valor para todas as linhas.<br><br>

**allow_duplicates**: é um valor booleano que verifica se uma coluna com o mesmo nome já existe ou não.

#### 1. Declarando uma lista como uma nova coluna

In [5]:
df['School'] = 'Training'
df

     Name  Age       City    Country    School
a    Jack   34     Sydeny  Australia  Training
b  Joshua   30      Delhi      India  Training
c     Tom   31     Mumbai      India  Training
d  Alicia   32  Bangalore      India  Training
e    John   16   New York         US  Training
f   Osama   17  las vegas         US  Training

#### 3. Utilizando .assign()

In [6]:
df = df.assign(Duration_months='24')
df

     Name  Age       City    Country    School Duration_months
a    Jack   34     Sydeny  Australia  Training              24
b  Joshua   30      Delhi      India  Training              24
c     Tom   31     Mumbai      India  Training              24
d  Alicia   32  Bangalore      India  Training              24
e    John   16   New York         US  Training              24
f   Osama   17  las vegas         US  Training              24

#### 4. Utilizando .insert()
**DataFrame.insert(loc, column, value, allow_duplicates=False)**

In [7]:
df.insert(2,'Age_range','16+',allow_duplicates=True)
df

     Name  Age Age_range       City    Country    School Duration_months
a    Jack   34       16+     Sydeny  Australia  Training              24
b  Joshua   30       16+      Delhi      India  Training              24
c     Tom   31       16+     Mumbai      India  Training              24
d  Alicia   32       16+  Bangalore      India  Training              24
e    John   16       16+   New York         US  Training              24
f   Osama   17       16+  las vegas         US  Training              24

#### Método 2 - Adicionar uma coluna ao Dataframe do Pandas com valores diferentes
##### Formas de fazer
1. Declarando uma lista como uma nova coluna
2. Utilizando loc (Você pode usar '.loc' com ':' para adicionar um valor especificado para todas as linhas.). Será visto em Manipulando Dataframes.
3. Utilizando .assign()
4. Utilizando .insert()
#####  Paramentros para insert
-loc: loc é um inteiro que é a localização de uma coluna onde queremos inserir uma nova coluna. Isso mudará a coluna existente naquela posição para a direita.<br>
-column: uma string que é o nome de uma coluna a ser inserida.<br>
-value: valor é simplesmente o valor a ser inserido. Pode ser um inteiro, uma string, um float ou mesmo uma série/lista de valores. Fornecer apenas um valor definirá o mesmo valor para todas as linhas.<br><br>
-**allow_duplicates**: é um valor booleano que verifica se uma coluna com o mesmo nome já existe ou não.

#### 1. Declarando uma lista como uma nova coluna

In [8]:
# 1. Declarando uma lista como uma nova coluna
df['Final_grade'] = ['A','D','B','A','A','C']
df

,Name,Age,Age_range,City,Country,School,Duration_months,Final_grade
a,Jack,34,16+,Sydeny,Australia,Training,24,A
b,Joshua,30,16+,Delhi,India,Training,24,D
c,Tom,31,16+,Mumbai,India,Training,24,B
d,Alicia,32,16+,Bangalore,India,Training,24,A
e,John,16,16+,New York,US,Training,24,A
f,Osama,17,16+,las vegas,US,Training,24,C

#### 3. Utilizando .assign()

In [9]:
df = df.assign(Family_income_per_year=[100000,80000,150000,60000,123000,65000])
df

,Name,Age,Age_range,City,Country,School,Duration_months,Final_grade,Family_income_per_year
a,Jack,34,16+,Sydeny,Australia,Training,24,A,100000
b,Joshua,30,16+,Delhi,India,Training,24,D,80000
c,Tom,31,16+,Mumbai,India,Training,24,B,150000
d,Alicia,32,16+,Bangalore,India,Training,24,A,60000
e,John,16,16+,New York,US,Training,24,A,123000
f,Osama,17,16+,las vegas,US,Training,24,C,65000

#### 4. Utilizando .insert()
**DataFrame.insert(loc, column, value, allow_duplicates=False)**

In [10]:
# Loc=1 é a posição que a coluna entrará
df.insert(loc=1, 
          column='Start_year', 
          value=[2017,2018,2018,2018,2017,2015])
df

,Name,Start_year,Age,Age_range,City,Country,School,Duration_months,Final_grade,Family_income_per_year
a,Jack,2017,34,16+,Sydeny,Australia,Training,24,A,100000
b,Joshua,2018,30,16+,Delhi,India,Training,24,D,80000
c,Tom,2018,31,16+,Mumbai,India,Training,24,B,150000
d,Alicia,2018,32,16+,Bangalore,India,Training,24,A,60000
e,John,2017,16,16+,New York,US,Training,24,A,123000
f,Osama,2015,17,16+,las vegas,US,Training,24,C,65000